# Pandas Interpolate

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Student_Result.csv")
df

FileNotFoundError: [Errno 2] No such file or directory: 'Student_Result.csv'

In [ ]:
df.interpolate()

In [ ]:
df.interpolate(method='linear')

In [ ]:
df.interpolate(method='time')

In [ ]:
type(df.date[0])

In [ ]:
df=pd.read_csv("Fortune_10.csv",parse_date=['date'])
df

In [ ]:
df.interpolate(method='index')

In [ ]:
df.interpolate()

In [ ]:
df.interpolate(limit=1)

In [ ]:
df.interpolate(limit=1,limit_direction='backward')

In [ ]:
df.interpolate(limit_area='inside')

In [ ]:
df.interpolate(limit_area='outside')

In [ ]:
df.interpolate(inplace=True)

In [ ]:
df=pd.read_csv("Fortune_10.csv")
df

In [ ]:
df.loc[[0,4]]

In [ ]:
df.loc[4,'Name']

In [ ]:
df.loc[0:3,'Growth']

# Groupby

In [ ]:
 import pandas as pd

In [ ]:
df=pd.read_csv("student_result1.csv")

In [ ]:
df

In [ ]:
gr=df.groupby(by='Section')
gr

In [ ]:
gr.groups

In [ ]:
gr=df.groupby(['Section','Class']).groups
gr

In [ ]:
for Section, df_1 in gr:
        print(Section)
        print(df_1)

In [ ]:
list(gr)

In [ ]:
dict(gr)

In [ ]:
gr1=df.groupby('Class').get_group(10)
gr1

In [ ]:
gr2=df.groupby('Section').get_group('A')
gr2

In [ ]:
gr2.sum()

In [ ]:
gr1.mean()

In [ ]:
gr1.agg(['sum','max','mean'])

# Merge and concate

In [6]:
import pandas as pd

In [7]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [8]:
sr2=pd.Series([3,4,5,6,7])
sr2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [9]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
3    6
4    7
dtype: int64

In [10]:
df1=pd.DataFrame({'ID':[1,2,3,4],
            'Name':['A','B','C','D'],
            'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [11]:
df2=pd.DataFrame({'ID':[5,6,7,8],
            'Name':['E','F','G','H'],
            'Class':[9,10,11,12]})
df2

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [12]:
pd.concat([df2,df1])

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [13]:
pd.concat([df2,df1],axis=1)

   ID Name  Class  ID Name  Class
0   5    E      9   1    A      5
1   6    F     10   2    B      6
2   7    G     11   3    C      7
3   8    H     12   4    D      8

In [14]:
pd.concat([df1,df2],axis=0)

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [18]:
df1=pd.DataFrame({'ID':[1,2,3,4],
            'Name':['A','B','C','D'],
            'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [19]:
df2=pd.DataFrame({'ID':[1,2],
            'Name':['A','B'],
            'Class':[5,6]})
df2

   ID Name  Class
0   1    A      5
1   2    B      6

In [31]:
pd.concat([df1,df2], axis=1)

   ID Name  Class   ID Name  Class
0   1    A      5  1.0    A    5.0
1   2    B      6  2.0    B    6.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [23]:
pd.concat([df1,df2], axis=1,join='inner')

   ID Name  Class  ID Name  Class
0   1    A      5   1    A      5
1   2    B      6   2    B      6

In [29]:
pd.concat([df1,df2], axis=1, join_axes = [df1.index])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [32]:
df1=pd.DataFrame({'ID':[1,2,3,4],
            'Name':['A','B','C','D'],
            'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [33]:
df2=pd.DataFrame({'ID':[1,2],
            'Name':['A','B'],
            'Class':[5,6]})
df2

   ID Name  Class
0   1    A      5
1   2    B      6

In [36]:
pd.concat([df1,df2],axis=1,keys=[' frist df1','second df2'])

   frist df1            second df2
          ID Name Class         ID Name Class
0          1    A     5        1.0    A   5.0
1          2    B     6        2.0    B   6.0
2          3    C     7        NaN  NaN   NaN
3          4    D     8        NaN  NaN   NaN

In [37]:
df1=pd.DataFrame({'ID':[1,2,3,4],
            'Name':['A','B','C','D'],
            'Class':[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [39]:
df2=pd.DataFrame({'Marks':[40,63,91,34]})
df2

   Marks
0     40
1     63
2     91
3     34

In [40]:
pd.concat([df1,df2])

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   40.0
1  NaN  NaN    NaN   63.0
2  NaN  NaN    NaN   91.0
3  NaN  NaN    NaN   34.0

In [41]:
pd.concat([df1,df2],sort=False)

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   40.0
1  NaN  NaN    NaN   63.0
2  NaN  NaN    NaN   91.0
3  NaN  NaN    NaN   34.0